app/Http/Controllers/User/ProfileController.php

update `users` set `name` = 'user updated', `email` = 'user-updated@test.com', `users`.`updated_at` = '2023-10-15 14:06:59' where `id` = 3
---
    public function update(UserProfileUpdateRequest $request): RedirectResponse
    {
        $request->user()->fill($request->validated());

        if ($request->user()->isDirty('email')) {
            $request->user()->email_verified_at = null;
        }

        $request->user()->save();

delete from `users` where `id` = 3
---
    public function destroy(Request $request): RedirectResponse
    {
        $request->validate([
            'password' => ['required', 'current_password'],
        ]);

        $user = $request->user();

        Auth::guard('user')->logout();

        $user->delete();