app/Http/Controllers/User/Auth/PasswordController.php

update `users` set `password` = '$2y$10$xCf1DkyLY4TprSStOPIzD.BE/mw7SayKkRc.CpUih32kPGoOmP75K', `users`.`updated_at` = '2023-10-15 14:09:29' where `id` = 3
---
    public function update(Request $request): RedirectResponse
    {
        $validated = $request->validate([
            'current_password' => ['required', 'current_password'],
            'password' => ['required', Password::defaults(), 'confirmed'],
        ]);

        $request->user()->update([
            'password' => Hash::make($validated['password']),
        ]);