app/Http/Controllers/User/Auth/RegisteredUserController.php

    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|string|email|max:255|unique:' . User::class,
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('user', 'user@test.com', '$2y$10$Fx.gGjhjhPRTS7sq.AT3q.xeXcgtFBvUFvd6wjBROtUPPdzPWIA/C', '2023-10-15 13:41:25', '2023-10-15 13:41:25')